Repository: andgineer/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/faq.po
Languages: de

source: I found a terrible bug: TRegExpr raises Access Violation exception!
de: Ich habe einen schrecklichen Fehler gefunden: TRegExpr löst Zugriffsverletzung aus!

source: **Answer**
de: **Antworten**

source: You must create the object before usage. So, after you declared something like:
de: Sie müssen das Objekt vor der Verwendung erstellen. Nachdem Sie also etwas erklärt haben:

source: do not forget to create the object instance:
de: Vergessen Sie nicht, die Objektinstanz zu erstellen:

source: Regular expressions with (?=...) do not work
de: Reguläre Ausdrücke mit (? = ...) funktionieren nicht

source: Look ahead is not implemented in the TRegExpr. But in many cases you can easily `replace it with simple subexpressions <regular_expressions.html#lookahead>`_.
de: Look Ahead ist in TRegExpr nicht implementiert. In vielen Fällen können Sie sie jedoch durch einfache `Unterausdrücke leicht ersetzen <regular_expressions.html#lookahead>`_.

source: Does it support Unicode?
de: Unterstützt es Unicode?

source: `How to use Unicode <tregexpr.html#unicode>`__
de: `Wie verwende ich Unicode? <tregexpr.html#unicode> __

source: Why does TRegExpr return more then one line?
de: Warum gibt TRegExpr mehr als eine Zeile zurück?

source: For example, r.e. ``<font .\*>`` returns the first ``<font``, then the rest of the file including last ``</html>``.
de: Zum Beispiel gibt re `` <font .\*>`` das erste `` zurück</font> <font``, then the rest of the file including last ``</html> <font .\*>``.</font>

source: For backward compatibility, `modifier /s <regular_expressions.html#modifier_s>`__ is ``On`` by default.
de: Für Rückwärtskompatibilität `Modifier / s <regular_expressions.html#modifier_s>`__ ist standardmäßig` `Ein``.

source: Switch it Off and ``.`` will match any but `Line separators <regular_expressions.html#syntax_line_separators>`__ - exactly as you wish.
de: Schalten Sie es aus und ``.`` passt zu allen anderen als &#39;Trennzeichen&#39; <regular_expressions.html#syntax_line_separators> __ - genau wie Sie es wünschen.

source: BTW I suggest ``<font ([^\n>]*)>``, in ``Match[1]`` will be the URL.
de: Übrigens empfehle ich `` <font ([^\n>] *)&gt; ``, in `` Match [1] `` wird die URL.</font>

source: Why does TRegExpr return more then I expect?
de: Warum gibt TRegExpr mehr als ich erwarte?

source: For example r.e. ``<p>(.+)</p>`` applyed to string ``<p>a</p><p>b</p>`` returns ``a</p><p>b`` but not ``a`` as I expected.
de: Zum Beispiel: `` <p> (. +) </p> `` auf String `` angewendet <p> ein </p><p> b </p> `` gibt `` a zurück </p><p> b`` aber nicht ``a`` wie ich erwartet hatte.

source: By default all operators works in ``greedy`` mode, so they match as more as it possible.
de: Standardmäßig arbeiten alle Operatoren im ``gierigen`` Modus, so dass sie so weit wie möglich zusammenpassen.

source: If you want ``non-greedy`` mode you can use ``non-greedy`` operators like ``+?`` and so on or switch all operators into ``non-greedy`` mode with help of modifier ``g`` (use appropriate TRegExpr properties or operator ``?(-g)`` in r.e.).
de: Wenn Sie den ``nicht-gierigen`` Modus wollen, können Sie `` nicht-gierige`&#39;-Operatoren wie ``+?`` Usw. verwenden, oder alle Operatoren mit Hilfe des Modifikators `` ```g`` (verwenden Sie die entsprechenden TRegExpr-Eigenschaften oder den Operator` `? (- g)` `in re).

source: How to parse sources like HTML with help of TRegExpr?
de: Wie kann man mit TRegExpr Quellen wie HTML analysieren?

source: Sorry folks, but it's nearly impossible!
de: Sorry Leute, aber es ist fast unmöglich!

source: Of course, you can easily use TRegExpr for extracting some information from HTML, as shown in my examples, but if you want accurate parsing you have to use real parser, not r.e.
de: Natürlich können Sie TRegExpr problemlos zum Extrahieren einiger Informationen aus HTML verwenden, wie in meinen Beispielen gezeigt. Wenn Sie jedoch eine genaue Analyse wünschen, müssen Sie einen echten Parser verwenden, nicht re

source: You can read full explanation in Tom Christiansen and Nathan Torkington ``Perl Cookbook``, for example.
de: Die vollständige Erklärung finden Sie beispielsweise in Tom Christiansen und Nathan Torkington, `` Perl Cookbook``.

source: In short - there are many structures that can be easy parsed by real parser but cannot at all by r.e., and real parser is much faster to do the parsing, because r.e. doesn't simply scan input stream, it performs optimization search that can take a lot of time.
de: Kurz gesagt, es gibt viele Strukturen, die mit echtem Parser einfach geparst werden können, von re aber gar nicht, und realer Parser ist beim Parsing viel schneller, da re nicht nur den Eingabestrom scannt, sondern eine Optimierungssuche ausführt, die dauern kann viel Zeit.

source: Is there a way to get multiple matches of a pattern on TRegExpr?
de: Gibt es eine Möglichkeit, mehrere Übereinstimmungen eines Musters auf TRegExpr abzurufen?

source: You can iterate matches with ExecNext method.
de: Sie können Übereinstimmungen mit der ExecNext-Methode wiederholen.

source: If you want some example, please take a look at ``TRegExpr.Replace`` method implementation or at the examples for `HyperLinksDecorator <demos.html>`_
de: Wenn Sie ein Beispiel wünschen, werfen Sie einen Blick auf die Implementierung der `TRegExpr.Replace``-Methode oder auf die Beispiele für` HyperLinksDecorator <demos.html> _

source: I am checking user input. Why does TRegExpr return ``True`` for wrong input strings?
de: Ich überprüfe die Benutzereingaben. Warum gibt TRegExpr für falsche Eingabezeichenfolgen &quot;True&quot; zurück?

source: In many cases TRegExpr users forget that regular expression is for **search** in input string.
de: In vielen Fällen vergessen TRegExpr-Benutzer, dass reguläre Ausdrücke für ** Suche ** in der Eingabezeichenfolge sind.

source: So, for example if you use ``\d{4,4}`` expression, you will get success for wrong user inputs like ``12345`` or ``any letters 1234``.
de: Wenn Sie beispielsweise `` \ d {4,4} `` Ausdruck verwenden, erhalten Sie Erfolg bei falschen Benutzereingaben wie ``12345`` oder `` any letters 1234``.

source: You have to check from line start to line end to ensure there are no anything else around: ``^\d{4,4}$``.
de: Sie müssen vom Anfang der Zeile bis zum Ende der Zeile überprüfen, um sicherzustellen, dass nichts anderes vorhanden ist: `` ^ \ d {4,4} $ ``.

source: Why does non-greedy iterators sometimes work as in greedy mode?
de: Warum funktionieren nichtgierige Iteratoren manchmal wie im gierigen Modus?

source: For example, the r.e. ``a+?,b+?`` applied to string ``aaa,bbb`` matches ``aaa,b``, but should it not match ``a,b`` because of non-greediness of first iterator?
de: Zum Beispiel entspricht das re ``a+?,b+?``, Das auf den String ``aaa,bbb`` angewendet wird, ``aaa,b``, sollte aber nicht mit ``a,b`` wegen Nicht-Gier passen des ersten Iterators?

source: This is because of TRegExpr way to work. In fact many others r.e. engines work exactly the same: they performe only ``simple`` search optimization, and do not try to do the best optimization.
de: Dies liegt an TRegExprs Arbeitsweise. Tatsächlich arbeiten viele andere re-Engines genau gleich: Sie führen nur eine &quot;einfache&quot; Suchoptimierung durch und versuchen nicht, die beste Optimierung zu erreichen.

source: In some cases it's bad, but in common it's rather advantage then limitation, because of performance and predictability reasons.
de: In manchen Fällen ist es schlecht, aber im Allgemeinen ist es aus Gründen der Leistung und Vorhersagbarkeit eher ein Vorteil als eine Einschränkung.

source: The main rule - r.e. first of all try to match from current place and only if that's completely impossible move forward by one char and try again from next position in the text.
de: Die Hauptregel - versuchen Sie zuerst, vom aktuellen Ort aus zu passen. Nur wenn dies völlig unmöglich ist, bewegen Sie sich um ein Zeichen vorwärts und versuchen Sie es erneut von der nächsten Position im Text.

source: So, if you use ``a,b+?`` it'll match ``a,b``. In case of ``a+?,b+?`` it's now not recommended (we add non-greedy modifyer) but still possible to match more then one ``a``, so TRegExpr will do it.
de: Wenn Sie also ``a,b+?`` Wird es ``a,b`` passen. Im Falle von ``a+?,b+?`` Wird es jetzt nicht empfohlen (wir fügen einen nicht-gierigen Modifikator hinzu), aber es ist immer noch möglich, mehr als einen ``a`` zu finden, also macht TRegExpr dies.

source: TRegExpr like Perl's or Unix's r.e. doesn't attempt to move forward and check - would it will be "better" match. Fisrt of all, just because there is no way to say it's more or less good match.
de: TRegExpr wie Perl oder Unix versucht nicht, sich vorwärts zu bewegen und zu prüfen - würde es &quot;besser&quot; passen. Fisrt von allem, nur weil es keine Möglichkeit gibt zu sagen, dass es mehr oder weniger gut passt.

source: How can I use TRegExpr with Borland C++ Builder?
de: Wie kann ich TRegExpr mit Borland C ++ Builder verwenden?

source: I have a problem since no header file (``.h`` or ``.hpp``) is available.
de: Ich habe ein Problem, da keine Header-Datei (``.h`` oder ``.hpp``) verfügbar ist.

source: Add ``RegExpr.pas`` to ``bcb`` project.
de: Fügen Sie ``RegExpr.pas`` zu ``bcb`` hinzu.

source: Compile project. This generates the header file ``RegExpr.hpp``.
de: Projekt kompilieren Dadurch wird die Header-Datei ``RegExpr.hpp`` generiert.

source: Now you can write code which uses the ``RegExpr`` unit.
de: Jetzt können Sie Code schreiben, der die ``RegExpr``-Einheit verwendet.

source: Don't forget to add ``#include “RegExpr.hpp”`` where needed.
de: Vergessen Sie nicht, `` #include “RegExpr.hpp” `` bei Bedarf hinzuzufügen.

source: Don't forget to replace all ``\`` in regular expressions with ``\\`` or redefined `EscChar <tregexpr.html#escchar>`__ const.
de: Vergessen Sie nicht, alle ``\`` in regulären Ausdrücken durch ``\\`` oder neu definierte `EscChar zu ersetzen <tregexpr.html#escchar> __ const.

source: Why many r.e. (including r.e. from TRegExpr help and demo) work wrong in Borland C++ Builder?
de: Warum arbeiten viele (einschließlich TRegExpr-Hilfe und -Demo) in Borland C ++ Builder falsch?

source: The hint is in the previous question ;) Symbol ``\`` has special meaning in ``C++``, so you have to ``escape`` it (as described in previous answer). But if you don't like r.e. like ``\\w+\\\\w+\\.\\w+`` you can redefine the constant ``EscChar`` (in ``RegExpr.pas``). For example ``EscChar = "/"``. Then you can write ``/w+/w+/./w+``, looks unusual but more readable.
de: Der Hinweis ist in der vorherigen Frage;) Das Symbol ``\`` hat eine besondere Bedeutung in `` C ++ ``, also müssen Sie es ``entkommen`` (wie in der vorherigen Antwort beschrieben). Wenn Sie nicht gerne ``\\w + \\\\ w + \\. \\ w + `` mögen, können Sie die Konstante ``EscChar`` (in ``RegExpr.pas``) neu definieren. Zum Beispiel `` EscChar = &quot;/&quot; ``. Dann können Sie `` / w + / w + /. / W + `` schreiben, sieht ungewöhnlich aus, ist aber lesbarer.
