Repository: andgineer/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: bg, de

source: `Български <https://regex.sorokin.engineer/bg/latest/index.html>`__
bg: Български

source: `Français <https://regex.sorokin.engineer/fr/latest/index.html>`__
bg: `Френски <https://regex.sorokin.engineer/fr/latest/index.html>`__

source: Introduction
bg: Въведение
de: Einführung

source: TRegExpr library implements `regular expressions <regular_expressions.html>`_.
bg: Библиотеката TRegExpr реализира &quot;регулярни изрази&quot; <regular_expressions.html>`_.
de: Die TRegExpr-Bibliothek implementiert `reguläre Ausdrücke <regular_expressions.html>`_.

source: Regular expressions are easy to use and powerful tool for sophisticated search and substitution and for template based text check.
bg: Редовните изрази са лесни за използване и мощно средство за сложно търсене и подмяна, както и за проверка на текст въз основа на шаблони.
de: Reguläre Ausdrücke sind ein benutzerfreundliches und leistungsfähiges Werkzeug für anspruchsvollere Such- und Ersetzungsaufgaben sowie für vorlagenbasiertes Überprüfen von Text.

source: It is especially useful for user input validation in input forms - to validate e-mail addresses and so on.
bg: Това е особено полезно за валидиране на потребителски вход във формуляри за въвеждане - за валидиране на имейл адреси и т.н.
de: Besonders nützlich sind sie zum Prüfen von Benutzereingaben in Eingabemasken, zum Validieren von E-Mail-Adressen usw.

source: Also you can extract phone numbers, ZIP-codes etc from web-pages or documents, search for complex patterns in log files and all you can imagine. Rules (templates) can be changed without your program recompilation.
bg: Също така можете да извличате телефонни номера, ZIP-кодове и т.н. от уеб-страници или документи, да търсите сложни модели в лог файловете и всичко, което можете да си представите. Правила (шаблони) могат да бъдат променяни без прекомпилация на програмата.
de: Auch können Sie damit Telefonnummern, Postleitzahlen usw. aus Webseiten oder Dokumenten extrahieren, nach komplexen Mustern in Protokolldateien suchen und was Sie sich sonst noch in der Art vorstellen können. Die Regeln (Vorlagen) lassen sich ändern, ohne die gesamte Anwendung neu kompilieren zu müssen.

source: TRegExpr is implemented in pure Pascal. It's included into `Lazarus (Free Pascal) <http://wiki.freepascal.org/Regexpr>`_ project. But also it exists as separate library and can be compiled by Delphi 2-7, Borland C++ Builder 3-6.
bg: TRegExpr се реализира в чист Pascal. Той е включен в `Lazarus (Free Pascal) <http://wiki.freepascal.org/Regexpr>`_ проект. Но тя съществува и като отделна библиотека и може да бъде компилирана от Delphi 2-7, Borland C ++ Builder 3-6.
de: TRegExpr ist 100% in Pascal implementiert. Es ist Bestandteil von `Lazarus (Free Pascal) <http://wiki.freepascal.org/Regexpr>`_ , aber auch als separate Bibliothek nutzbar und kann auch mit Delphi 2-7 oder dem Borland C ++ Builder 3-6 kompiliert werden.

source: Reviews
bg: Отзиви
de: Rezensionen

source: `How good the library was met <https://sorokin.engineer/posts/en/regexpstudio_site_is_lunched.html>`_.
bg: - Колко хубава беше библиотеката <https://sorokin.engineer/posts/en/regexpstudio_site_is_lunched.html>`_.
de: Machen Sie sich ein Bild von der `Resonanz <https://sorokin.engineer/posts/en/regexpstudio_site_is_lunched.html>`_ bei den Anwendern.

source: Quick start
bg: Бърз старт
de: Schnellstart

source: To use the library just add `the sources <https://github.com/andgineer/TRegExpr/blob/master/src/RegExpr.pas>`_ to you project and use the class `TRegExpr <tregexpr.html>`_.
bg: За да използвате библиотеката, просто добавете `източниците <https://github.com/andgineer/TRegExpr/blob/master/src/RegExpr.pas>`_ за да проектирате и използвате класа` TRegExpr <tregexpr.html>`_.
de: Um die Bibliothek zu verwenden, fügen Sie einfach `den Quelltext <https://github.com/andgineer/TRegExpr/blob/master/src/RegExpr.pas>`__ Ihrem Projekt hinzu und nutzen Sie die Klasse `TRegExpr <tregexpr.html>`__.

source: In the `FAQ <faq.html>`_ you can learn from others users problems.
bg: В `Често задавани въпроси <faq.html>`_ можете да научите от проблемите на другите потребители.
de: In den `FAQ <faq.html>`__ können Sie aus den Problemen anderer Nutzer lernen.

source: Ready to run Windows application `REStudio <https://github.com/andgineer/TRegExpr/releases/download/0.952b/restudio.zip>`__ will help you learn and debug regular expressions.
bg: Готови ли сте да стартирате Windows приложението &quot;REStudio&quot; <https://github.com/andgineer/TRegExpr/releases/download/0.952b/restudio.zip>`__ ще ви помогне да научите и отстраните грешки на регулярни изрази.
de: Die benutzerfreundliche Windows-Anwendung `REStudio <https://github.com/andgineer/TRegExpr/releases/download/0.952b/restudio.zip>`__ hilft Ihnen dabei, reguläre Ausdrücke zu erlernen und zu debuggen.

source: Feedback
bg: Обратна връзка

source: If you see any problems, please `create the bug <https://github.com/andgineer/TRegExpr/issues>`_.
bg: Ако видите някакви проблеми, моля създайте бъг <https://github.com/andgineer/TRegExpr/issues>`_.
de: Wenn Sie auf ein Problem stoßen, erstellen Sie bitte einen `Fehlerbericht <https://github.com/andgineer/TRegExpr/issues>`__.

source: Source code
bg: Програмен код
de: Quellcode

source: Pure Object Pascal.
bg: Чист обект Pascal.
de: Ausschließlich Object Pascal.

source: `Original version <https://github.com/andgineer/TRegExpr>`_
bg: `Оригинална версия <https://github.com/andgineer/TRegExpr>`_

source: `FreePascal fork (GitHub mirror of the SubVersion) <https://github.com/graemeg/freepascal/blob/master/packages/regexpr/src/regexpr.pas>`_
bg: `FreePascal вилица (GitHub огледало на SubVersion) <https://github.com/graemeg/freepascal/blob/master/packages/regexpr/src/regexpr.pas>`_
de: `FreePascal-Fork (GitHub-Spiegel der Subversion) <https://github.com/graemeg/freepascal/blob/master/packages/regexpr/src/regexpr.pas>`__

source: Documentation
bg: документация
de: Dokumentation

source: Translations
bg: Преводи
de: Übersetzungen

source: The documentation is available in English and `Russian <https://regexpr.sorokin.engineer/ru/latest/>`_.
bg: Документацията е на английски и руски <https://regexpr.sorokin.engineer/ru/latest/>`_.
de: Die Dokumentation ist in `Englisch verfügbar <https://regexpr.sorokin.engineer/en/latest/>`__.

source: There are also old translations to German, Bulgarian, French and Spanish. If you want to help to update this old translations please `contact me <https://github.com/andgineer>`_.
bg: Има и стари преводи на немски, български, френски и испански. Ако искате да помогнете да актуализирате старите преводи, моля свържете се с мен <https://github.com/andgineer>`_.
de: Es gibt auch alte Übersetzungen in Deutsch, Bulgarisch, Französisch und Spanisch. Wenn Sie bei der Aktualisierung dieser alten Übersetzungen mithelfen möchten, kontaktieren Sie mich bitte <https://github.com/andgineer>`_.

source: They are already machine-translated and need only proof-reading and may be some copy-pasting from old translations.
bg: Те вече са преведени машинно и се нуждаят само от корекционно четене и може да са копиране от стари преводи.
de: Sie sind bereits maschinell übersetzt und müssen nur korrigiert werden. Möglicherweise werden auch alte Übersetzungen kopiert.

source: Gratitude
bg: благодарност
de: Dankbarkeit

source: Many features suggested and a lot of bugs founded (and even fixed) by TRegExpr’s contributors.
bg: Предложени са много функции и много грешки, основани (и дори фиксирани) от участниците в TRegExpr.
de: Viele Funktionen wurden vorgeschlagen und viele Fehler wurden von TRegExpr-Mitarbeitern begründet (und sogar behoben).

source: I cannot list here all of them, but I do appreciate all bug-reports, features suggestions and questions that I am receiving from you.
bg: Не мога да изброявам всички тях, но оценявам всички доклади за грешки, предложения и въпроси, които получавам от вас.
de: Ich kann hier nicht alle aufführen, aber ich freue mich über alle Fehlerberichte, Vorschläge und Fragen, die ich von Ihnen bekomme.

source: Guido Muehlwitz - found and fixed ugly bug in big string processing
bg: Guido Muehlwitz - открил и фиксирал грозна грешка при обработката на големи низове
de: Guido Muehlwitz - hässlicher Fehler in der Verarbeitung großer Seiten gefunden und behoben

source: Steve Mudford - implemented Offset parameter
bg: Стив Мъдфорд - внедрен параметър Offset
de: Steve Mudford - Offset-Parameter implementiert

source: Martin Baur (`www.mindpower.com <http://www.mindpower.com>`__) - German translation, usefull suggestions
bg: Мартин Баур (&quot;www.mindpower.com.&quot; <http://www.mindpower.com>`__) - немски превод, полезни предложения
de: Martin Baur (`www.mindpower.com) <http://www.mindpower.com>`__) - deutsche Übersetzung, nützliche Vorschläge

source: Simeon Lilov - Bulgarian translation
bg: Симеон Лилов - превод на български език
de: Simeon Lilov - Bulgarische Übersetzung

source: Juergen Schroth - bug hunting and useful suggestions
bg: Юрген Шрот - лов на бъгове и полезни предложения
de: Jürgen Schroth - Käferjagd und nützliche Vorschläge

source: Martin Ledoux - French translation
bg: Мартин Леду - превод на френски
de: Martin Ledoux - französische Übersetzung

source: Diego Calp, Argentina - Spanish translation
bg: Diego Calp, Аржентина - превод на испански
de: Diego Calp, Argentinien - spanische Übersetzung

source: English
de: `English <https://regex.sorokin.engineer/en/latest/index.html>`__

source: `Deutsch <https://regex.sorokin.engineer/de/latest/index.html>`__
de: Deutsch

source: New translations are based on `GetText <https://en.wikipedia.org/wiki/Gettext>`_ and can be edited with `Weblate <https://hosted.weblate.org/projects/tregexpr/>`_.
de: Neue Übersetzungen basieren auf GetText <https://en.wikipedia.org/wiki/Gettext>`_ und kann mit` transifex.com bearbeitet werden <https://www.transifex.com/masterAndrey/tregexpr/dashboard/>`_.
